[Killed] BlockStatement
src/calculator.js:3:68
 const WEEKS_PER_YEAR = 52;
 
-function yearlyEnergyCost({ kwhPerUse, usesPerWeek }, pricePerKwh) {
-    return kwhPerUse * usesPerWeek * WEEKS_PER_YEAR * pricePerKwh;
-}
+function yearlyEnergyCost({ kwhPerUse, usesPerWeek }, pricePerKwh) {}
 
 function totalCost(product, pricePerKwh, years) {
killedBy: yearlyEnergyCost computes expected value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 130
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:4:12
 const WEEKS_PER_YEAR = 52;
 
 function yearlyEnergyCost({ kwhPerUse, usesPerWeek }, pricePerKwh) {
-    return kwhPerUse * usesPerWeek * WEEKS_PER_YEAR * pricePerKwh;
+    return kwhPerUse * usesPerWeek / WEEKS_PER_YEAR * pricePerKwh;
 }
 
killedBy: yearlyEnergyCost computes expected value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 130
Received: 0.04807692307692308

[Killed] ArithmeticOperator
src/calculator.js:4:12
 const WEEKS_PER_YEAR = 52;
 
 function yearlyEnergyCost({ kwhPerUse, usesPerWeek }, pricePerKwh) {
-    return kwhPerUse * usesPerWeek * WEEKS_PER_YEAR * pricePerKwh;
+    return kwhPerUse * usesPerWeek * WEEKS_PER_YEAR / pricePerKwh;
 }
 
killedBy: yearlyEnergyCost computes expected value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 130
Received: 520

[Killed] BlockStatement
src/calculator.js:7:49
     return kwhPerUse * usesPerWeek * WEEKS_PER_YEAR * pricePerKwh;
 }
 
-function totalCost(product, pricePerKwh, years) {
-    return product.purchasePrice + yearlyEnergyCost(product, pricePerKwh) * years;
-}
+function totalCost(product, pricePerKwh, years) {}
 
 function compareProducts(a, b, pricePerKwh, years) {
killedBy: totalCost adds purchase + energy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 278
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:8:12
 }
 
 function totalCost(product, pricePerKwh, years) {
-    return product.purchasePrice + yearlyEnergyCost(product, pricePerKwh) * years;
+    return product.purchasePrice - yearlyEnergyCost(product, pricePerKwh) * years;
 }
 
killedBy: totalCost adds purchase + energy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 278
Received: 122

[Killed] ArithmeticOperator
src/calculator.js:8:36
 }
 
 function totalCost(product, pricePerKwh, years) {
-    return product.purchasePrice + yearlyEnergyCost(product, pricePerKwh) * years;
+    return product.purchasePrice + yearlyEnergyCost(product, pricePerKwh) / years;
 }
 
killedBy: totalCost adds purchase + energy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 278
Received: 208.66666666666666

[Killed] BlockStatement
src/calculator.js:11:52
     return product.purchasePrice + yearlyEnergyCost(product, pricePerKwh) * years;
 }
 
-function compareProducts(a, b, pricePerKwh, years) {
-    const aTotal = totalCost(a, pricePerKwh, years);
-    const bTotal = totalCost(b, pricePerKwh, years);
-
-    const cheaper = aTotal <= bTotal ? a.name : b.name;
-    const diff = Math.abs(aTotal - bTotal);
-
-    return { aTotal, bTotal, cheaper, diff };
-}
+function compareProducts(a, b, pricePerKwh, years) {}
 
 function breakEvenYear(a, b, pricePerKwh, maxYears = 50) {
killedBy: compareProducts chooses cheaper
statusReason: TypeError: Cannot read properties of undefined (reading 'cheaper')

[Killed] EqualityOperator
src/calculator.js:15:21
     const aTotal = totalCost(a, pricePerKwh, years);
     const bTotal = totalCost(b, pricePerKwh, years);
 
-    const cheaper = aTotal <= bTotal ? a.name : b.name;
+    const cheaper = aTotal > bTotal ? a.name : b.name;
     const diff = Math.abs(aTotal - bTotal);
 
killedBy: compareProducts chooses cheaper
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "A"

[Killed] EqualityOperator
src/calculator.js:15:21
     const aTotal = totalCost(a, pricePerKwh, years);
     const bTotal = totalCost(b, pricePerKwh, years);
 
-    const cheaper = aTotal <= bTotal ? a.name : b.name;
+    const cheaper = aTotal < bTotal ? a.name : b.name;
     const diff = Math.abs(aTotal - bTotal);
 
killedBy: compareProducts tie-break: if totals equal, A is chosen (<= not <)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "B"

[Killed] ArithmeticOperator
src/calculator.js:16:27
     const bTotal = totalCost(b, pricePerKwh, years);
 
     const cheaper = aTotal <= bTotal ? a.name : b.name;
-    const diff = Math.abs(aTotal - bTotal);
+    const diff = Math.abs(aTotal + bTotal);
 
     return { aTotal, bTotal, cheaper, diff };
killedBy: compareProducts tie-break: if totals equal, A is chosen (<= not <)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 720

[Killed] BlockStatement
src/calculator.js:21:58
     return { aTotal, bTotal, cheaper, diff };
 }
 
-function breakEvenYear(a, b, pricePerKwh, maxYears = 50) {
-
-    const diffAt = (y) => totalCost(a, pricePerKwh, y) - totalCost(b, pricePerKwh, y);
-
-    let prev = diffAt(0);
-    for (let year = 1; year <= maxYears; year += 1) {
-        const cur = diffAt(year);
-
-        if (prev === 0) return year;
-        if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
-
-        prev = cur;
-    }
-    return null;
-}
+function breakEvenYear(a, b, pricePerKwh, maxYears = 50) {}
 
 module.exports = {
killedBy: breakEvenYear returns the first year where costs flip
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:23:27
 
 function breakEvenYear(a, b, pricePerKwh, maxYears = 50) {
 
-    const diffAt = (y) => totalCost(a, pricePerKwh, y) - totalCost(b, pricePerKwh, y);
+    const diffAt = (y) => totalCost(a, pricePerKwh, y) + totalCost(b, pricePerKwh, y);
 
     let prev = diffAt(0);
killedBy: breakEvenYear returns year or null
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ArrowFunction
src/calculator.js:23:20
 
 function breakEvenYear(a, b, pricePerKwh, maxYears = 50) {
 
-    const diffAt = (y) => totalCost(a, pricePerKwh, y) - totalCost(b, pricePerKwh, y);
+    const diffAt = () => undefined;
 
     let prev = diffAt(0);
killedBy: breakEvenYear returns year or null
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/calculator.js:26:53
     const diffAt = (y) => totalCost(a, pricePerKwh, y) - totalCost(b, pricePerKwh, y);
 
     let prev = diffAt(0);
-    for (let year = 1; year <= maxYears; year += 1) {
-        const cur = diffAt(year);
-
-        if (prev === 0) return year;
-        if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
-
-        prev = cur;
-    }
+    for (let year = 1; year <= maxYears; year += 1) {}
     return null;
 }
killedBy: breakEvenYear returns year or null
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/calculator.js:26:24
     const diffAt = (y) => totalCost(a, pricePerKwh, y) - totalCost(b, pricePerKwh, y);
 
     let prev = diffAt(0);
-    for (let year = 1; year <= maxYears; year += 1) {
+    for (let year = 1; false; year += 1) {
         const cur = diffAt(year);
 
killedBy: breakEvenYear returns year or null
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] ConditionalExpression
src/calculator.js:29:13
     for (let year = 1; year <= maxYears; year += 1) {
         const cur = diffAt(year);
 
-        if (prev === 0) return year;
+        if (true) return year;
         if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
 

[Survived] ConditionalExpression
src/calculator.js:29:13
     for (let year = 1; year <= maxYears; year += 1) {
         const cur = diffAt(year);
 
-        if (prev === 0) return year;
+        if (false) return year;
         if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
 

[Killed] LogicalOperator
src/calculator.js:30:13
         const cur = diffAt(year);
 
         if (prev === 0) return year;
-        if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
+        if (prev > 0 && cur < 0 && prev < 0 && cur > 0) return year;
 
         prev = cur;
killedBy: breakEvenYear returns year or null
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] EqualityOperator
src/calculator.js:30:39
         const cur = diffAt(year);
 
         if (prev === 0) return year;
-        if ((prev > 0 && cur < 0) || (prev < 0 && cur > 0)) return year;
+        if ((prev > 0 && cur < 0) || (prev >= 0 && cur > 0)) return year;
 
         prev = cur;
killedBy: breakEvenYear returns the first year where costs flip
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2
