[Killed] BlockStatement
src/io.js:1:28
-function parseLines(input) {
-    return input
-        .split(/\r?\n/)
-        .map((s) => s.trim())
-        .filter((s) => s.length > 0);
-}
+function parseLines(input) {}
 
 module.exports = { parseLines };
killedBy: parseLines trims whitespace and removes empty lines
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["a", "b", "c"]
Received: undefined

[Killed] MethodExpression
src/io.js:2:12
 function parseLines(input) {
-    return input
-        .split(/\r?\n/)
-        .map((s) => s.trim())
-        .filter((s) => s.length > 0);
+    return input.split(/\r?\n/).map(s => s.trim());
 }
 
killedBy: parseLines trims whitespace and removes empty lines
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    "a",
+   "",

[Killed] ArrowFunction
src/io.js:4:14
 function parseLines(input) {
     return input
         .split(/\r?\n/)
-        .map((s) => s.trim())
+        .map(() => undefined)
         .filter((s) => s.length > 0);
 }
killedBy: parseLines trims whitespace and removes empty lines
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/io.js:4:21
 function parseLines(input) {
     return input
         .split(/\r?\n/)
-        .map((s) => s.trim())
+        .map((s) => s)
         .filter((s) => s.length > 0);
 }
killedBy: parseLines trims whitespace and removes empty lines
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 4

  Array [
-   "a",
-   "b",

[Killed] ConditionalExpression
src/io.js:5:24
     return input
         .split(/\r?\n/)
         .map((s) => s.trim())
-        .filter((s) => s.length > 0);
+        .filter((s) => true);
 }
 
killedBy: parseLines trims whitespace and removes empty lines
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    "a",
+   "",

[Killed] EqualityOperator
src/io.js:5:24
     return input
         .split(/\r?\n/)
         .map((s) => s.trim())
-        .filter((s) => s.length > 0);
+        .filter((s) => s.length <= 0);
 }
 
killedBy: parseLines trims whitespace and removes empty lines
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Array [
-   "a",
-   "b",

[Killed] ObjectLiteral
src/io.js:8:18
         .filter((s) => s.length > 0);
 }
 
-module.exports = { parseLines };
+module.exports = {};
killedBy: parseLines trims whitespace and removes empty lines
statusReason: TypeError: parseLines is not a function
